export default {
    'settings': {
        'settings': 'Настройки',
        'language': 'Язык',
        'theme': 'Тема',
        'logout': 'Выход',
    },
    'menu': {
        'headerName': 'Основное меню',
        'noCities': 'Нет городов',
        'loading': 'Загрузка городов...',
        'error': 'Ошибка при загрузке городов'
    },
    'popUps': {
        'close': 'Закрыть',
        'save': 'Сохранить',
        'cancel': 'Отменить',
        'ok': 'Ок'
    },
    'mainMenu': {
        'occupancy': 'Загруженность',
        'statistics': 'Статистика',
        'attendance': 'Посещение',
        'users': 'Пользователи',
        'settings': 'Изменить настройки'
    },
    'occupationPage': {
        'leftToggleName': 'Корпус',
        'searchButton': 'Поиск',
        'noRooms': 'Нет необходимых аудиторий',
        'floor': 'Этаж',
        'typeOfRoom': 'Тип аудитории',
        'noBuildingsChosen': 'Корпус не выбран. Пожалуйста, выберите что-то из списка...',
        'noBuildings': 'Никаких корпусов не найдено',
        'error': 'Произошла ошибка при загрузке данных. Пожалуйста, обратитесь в тех. поддержку: {address}',
    },
    'errorOccured': {
        'name': 'Произошла ошибка',
        'meaning': 'Это означает, что:',
        '404': 'Страница не найдена',
        '401': 'Вы не авторизованы',
        '403': 'У вас недостаточно прав',
        '500': 'Ошибка со стороны сервера',
        'else': 'Упс. Что-то пошло не так... Пожалуйста, обратитесь в тех. поддержку'
    }
}